testFiles/cases/Duct/case/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                  https://gitlab.com/opensimproject/CfdOF                    |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

// Patches to create.
patches
(
    {
        name inlet;
        patchInfo
        {
            type patch;
        }
        constructFrom patches;
        patches ( "patch_1_.*" );
    }

    {
        name outlet;
        patchInfo
        {
            type patch;
        }
        constructFrom patches;
        patches ( "patch_2_.*" );
    }

    {
        name wall;
        patchInfo
        {
            type wall;
        }
        constructFrom patches;
        patches ( "patch_3_.*" );
    }

    {
        name defaultFaces;
        patchInfo
        {
            type patch;
        }
        constructFrom patches;
        patches ( "patch_0_.*" );
    }


    {
        name baffle_master;
        patchInfo
        {
            type cyclic;
            matchTolerance 1e-04;
            neighbourPatch baffle_slave;
        }

        constructFrom patches;
        patches ( "CfdFluidBoundary003_.*" );
    }

    {
        name baffle_slave;
        patchInfo
        {
            type cyclic;
            matchTolerance 1e-04;
            neighbourPatch baffle_master;
        }

        constructFrom patches;
        patches ( "CfdFluidBoundary003_.*_slave" );
    }

);


// ************************************************************************* //
