testFiles/cases/Duct/case/0/p
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                  https://gitlab.com/opensimproject/CfdOF                    |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{

    inlet
    {
        type        zeroGradient;
    }

    outlet
    {
        type        totalPressure;
        p0          uniform 0.0;
        value       $internalField;
    }

    wall
    {
        type        zeroGradient;
    }

    baffle_master
    {
        type        porousBafflePressure;
        patchType   cyclic;
        length      1.0;
        I           0.84;
        D           0;
        value       $internalField;
    }
    baffle_slave
    {
        type        porousBafflePressure;
        patchType   cyclic;
        length      1.0;
        I           0.84;
        D           0;
        value       $internalField;
    }

    defaultFaces
    {
        type        zeroGradient;
    }

}

// ************************************************************************* //
